var ClassData = (function() {
	
	var
	category = [
		'人文及創作', '軍警公教', '民生服務', '經營管理', 
		'製造與加工', '電資與機械', '規劃與建造', '生醫農糧'
	], 
	subCategory = {
		'人文及創作': ['音樂歌曲', '繪畫撰刻', '器物工藝'],
		'軍警公教': ['軍事國防', '警消治安', '小學教師'],
		'民生服務': ['餐飲業', '飯店住宿', '旅遊休閒'],
		'經營管理': ['金融投資', '物流運籌', '會計財務'],
		'製造與加工': ['橡膠塑膠', '金屬製造', '化學相關'],
		'電資與機械': ['科技資訊', '網路軟體', '電信通訊'],
		'規劃與建造': ['景觀都計', '營造建築', '土木工程'],
		'生醫農糧': ['生化醫藥', '醫學診療', '護理復健']
	},
	className = {
		'音樂歌曲': ['歌手', '音樂製作', '吉他演奏'], 
		'繪畫撰刻': ['油畫繪製', '水彩繪畫', '木頭雕刻'], 
		'器物工藝': ['陶藝製造', '玻璃工藝', '捏麵人'], 
		'軍事國防': ['職業軍官', '情報軍官', '技術軍官'], 
		'警消治安': ['警察', '消防員', '海關人員'], 
		'小學教師': ['音樂老師', '童軍教育', '英文老師'], 
		'餐飲業': ['服務生', '廚師', '甜點師'], 
		'飯店住宿': ['⺠宿經營', '飯店管理', '酒店服務'], 
		'旅遊休閒': ['地勤人員', '導遊', '門市經理'], 
		'金融投資': ['投資', '理財專員', '金融操作'], 
		'物流運籌': ['物流管理', '運輸司機', '倉庫管理'], 
		'會計財務': ['財務經理', '會計人員', '出納總務'], 
		'橡膠塑膠': ['玩具製造', '工業橡膠', '塑膠射出'], 
		'金屬製造': ['金屬加工', 'CNC操作', '車床技術員'], 
		'化學相關': ['對色專員', '製程工程師', '研發藥師'], 
		'科技資訊': ['IC設計', '硬體製造', '電腦組裝'], 
		'網路軟體': ['MIS管理', '網站工程', '遊戲設計'], 
		'電信通訊': ['電信工程師', '通訊技師', '設備維修'], 
		'景觀都計': ['都市計畫', '景觀建設', '市容造景'], 
		'營造建築': ['房屋建造', '建築繪圖', '營建工程師'], 
		'土木工程': ['土地開發', '工地主任', '道路建設'], 
		'生化醫藥': ['保健⻝品', '糧⻝改良', '臨床研究'], 
		'醫學診療': ['醫療美容', '臨床心理', '外科手術'], 
		'護理復健': ['護理師', '物理治療', '看護']
	};
		
	var getCategory = function() {
		return category;
	}
	
	var getSubCategory = function(category_name) {
		
		if (!subCategory.hasOwnProperty(category_name)) {
			return [];
		}
		
		return subCategory[category_name];
	}
	
	var getClass = function(subCategory_name) {
		
		if (!className.hasOwnProperty(subCategory_name)) {
			return [];
		}
		
		return className[subCategory_name];
	}
	
	return {
		getCategory: getCategory,
		getSubCategory: getSubCategory,
		getClass: getClass
	}
})();